app/Controllers/CartController.php

    public function list()
    {
        $cartItems = $this->cartModel->select('cart.id, products.name as product_name, products.price, cart.quantity')
            ->join('products', 'products.id = cart.product_id')
            ->where(['cart.user_id' => 1, 'cart.action' => 0])
            ->findAll();
---
SELECT `cart`.`id`, `products`.`name` as `product_name`, `products`.`price`, `cart`.`quantity`
FROM `cart`
JOIN `products` ON `products`.`id` = `cart`.`product_id`
WHERE `cart`.`user_id` = 1
AND `cart`.`action` = 0