app/Controllers/ProductController.php

    public function addToCart()
    {
        $json = $this->request->getJSON();


        // log_message('debug', 'Received data: ' . print_r($json, true));

        if (!$json) {
            return $this->failValidationErrors('Invalid JSON data.');
        }

        $userId = $json->user_id ?? null;
        $productId = $json->product_id ?? null;
        $quantity = $json->quantity ?? null;

        if (empty($userId) || empty($productId) || empty($quantity)) {
            return $this->failValidationErrors('User ID, Product ID, and Quantity are required.');
        }

        $cartModel = new CartModel();

        $data = [
            'user_id' => $userId,
            'product_id' => $productId,
            'quantity' => $quantity,
        ];

        if ($cartModel->insert($data)) {
---
INSERT INTO `cart` (`user_id`, `product_id`, `quantity`) VALUES (1, 6, 1)