app/Models/ProductModel.php

    public function getProductsWithImages()
    {
        $products = $this->db->table('products')
            ->select('products.id, products.name, products.description, products.price, GROUP_CONCAT(product_images.image_path) as images')
            ->join('product_images', 'product_images.product_id = products.id', 'left')
            ->where('status',0)
            ->groupBy('products.id')
            ->get()
            ->getResultArray();
---
SELECT `products`.`id`, `products`.`name`, `products`.`description`, `products`.`price`, GROUP_CONCAT(product_images.image_path) as images
FROM `products`
LEFT JOIN `product_images` ON `product_images`.`product_id` = `products`.`id`
WHERE `status` = 0
GROUP BY `products`.`id`